test_cases/set1_alpha2_iddes_spalding_g5000/Allrun.local
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# mesh creation with blockMesh
runApplication blockMesh
# decompose mesh
runApplication decomposePar
# distribute 0.orig directory to processor folders
restore0Dir -processor
# dummy file for post-processing
touch post.foam
# execute flow solver
runParallel rhoPimpleFoam -parallel